---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList{System.Int32})
source: html/96cbef6a-6828-b026-cf5f-4104a7717b91.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	IList<int> values
)
```

## Parameters
- **name** (`System.String`)
- **values** (`System.Collections.Generic.IList < Int32 >`)